jsyk/PIP-Watch/stm32f103_rtos_u8g_epd_btm/battery.c
#include "battery.h"
#include "main.h"

/* Scheduler includes. */
#include "task.h"

/* Library includes. */
#include "stm32f10x_it.h"

/* queue of AD-converted data values received in irq handler */
QueueHandle_t adcValueQueue = NULL;

int vbat_measured = 0;
int vbat_percent = 0;


void ADC_IRQHandler(void)
{
    long xHigherPriorityTaskWoken = pdFALSE;

    if (adcValueQueue != NULL && ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == SET) {
        int val = ADC_GetConversionValue(ADC1);
        xQueueSendFromISR(adcValueQueue, &val, &xHigherPriorityTaskWoken);
    }

    /* clear ADC1 irq pending bit */
    ADC_ClearITPendingBit(ADC1, ADC_IT_EOC);

    /* signal end-of-irq and possible reschedule point */
    portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
}

void BatteryTask(void *pvParameters)
{
    /* start the ADC calibration */
    ADC_StartCalibration(ADC1);
    do {
        /* wait 10 ms */
        vTaskDelay( ( TickType_t ) 10 / portTICK_PERIOD_MS );
        /* RESET = calibration done */
    } while (ADC_GetCalibrationStatus(ADC1) != RESET);

    /* queue of ADC data values received in irq handler */
    adcValueQueue = xQueueCreate(4, sizeof(int));

    while (1) {
        /* measure internal Vref=1.20V */
        ADC_RegularChannelConfig(ADC1, ADC_Channel_17, 1, ADC_SampleTime_71Cycles5);    // Vref
        ADC_ClearFlag(ADC1, ADC_FLAG_STRT);
        ADC_Cmd(ADC1, ENABLE);
        /* wait till the conversion ends */
        int ad_vref = 0;
        xQueueReceive(adcValueQueue, &ad_vref, portMAX_DELAY);

        /* measure battery voltage on channel 8 */
        ADC_RegularChannelConfig(ADC1, ADC_Channel_8, 1, ADC_SampleTime_71Cycles5);
        ADC_ClearFlag(ADC1, ADC_FLAG_STRT);
        ADC_Cmd(ADC1, ENABLE);
        /* wait till the conversion ends */
        int ad_vbat = 0;
        xQueueReceive(adcValueQueue, &ad_vbat, portMAX_DELAY);

        /* compensate for resistor divider by 2 */
        ad_vbat *= 2;

        /* digital value of ad_vref corresponds to 1.20 Volts */
        /* ad_vref/1.20 = ad_vbat/vbat */
        /* vbat = ad_vbat/ad_vref * 1.20 */

        vbat_measured = ad_vbat * 120 / ad_vref;

        vbat_percent = (vbat_measured - VBAT_0_PERCENT) * 100 / (VBAT_100_PERCENT - VBAT_0_PERCENT);

        /* wait 4 seconds */
        vTaskDelay( ( TickType_t ) 4000 / portTICK_PERIOD_MS );
    }
}
